---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.DeleteAssemblyInstWithViewsWarn
source: html/96d73728-936e-af66-5489-703bb9fd57ef.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.DeleteAssemblyInstWithViewsWarn Property

Deleting this assembly will remove the assembly from the project and any views associated with that assembly.

## Syntax (C#)
```csharp
public static FailureDefinitionId DeleteAssemblyInstWithViewsWarn { get; }
```